package kholmurodov.ismoil

data class Puzzle(val question: String, val answer: String)

object Puzzles {
    val list = listOf(
        Puzzle("Что такое корень квадратный?", "Корень"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Одна из японских авиакомпаний рисует на носу своих самолетов огромные глаза. Зачем?", "Отпугивать птиц"),
        Puzzle("Из кожи именно этого животного были впервые изготовлены напильники, которыми полировали дерево и даже мрамор?", "Акулы"),
        Puzzle("Судя по названию этой страны, она должна состоять в основном из равнин и степей. Тем не менее большая часть равнин ей уже не принадлежит, а в настоящее время около половины ее территории занимают горы, холмы и леса. Что это за страна?", "Польша"),
        Puzzle("Какой металл встречается в природе реже чем платина или уран, однако до последнего времени был почти в каждом доме?", "Ртуть"),
        Puzzle("Какой предмет лишний в этом ряду: яблоко, банан, груша, апельсин, манго, перец, ананас, виноград, клубника, сливы?", "Сливы"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),
        Puzzle("Какое самое большое число в математике?", "Миллион"),

    )
}